расш/src/InformationRegisters/Расш_ЗарплатаСразуРегистрСведенийНастройки/Расш_ЗарплатаСразуРегистрСведенийНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Расш_ЗарплатаСразуРегистрСведенийНастройки</name>
  <resources>
    <name>ЛимитПлатежаСАвтоакцептом</name>
    <comment>Лимит платежа с автоакцептом</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛимитПлатежаСРучнымСогласованием</name>
    <comment>Лимит платежа с ручным согласованием</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноДопустимаяКСнятиюСумма</name>
    <comment>Максимально допустимая к снятию сумма по всем сотрудникам (месяц)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрофильГруппДоступаРасчетчик</name>
    <comment>Профиль групп доступа расчетчик для уведомлений</comment>
    <type>
      <types>CatalogRef.ПрофилиГруппДоступа</types>
    </type>
  </resources>
  <resources>
    <name>ПрофильГруппДоступаСтаршийРасчетчик</name>
    <comment>Профиль групп доступа старший расчетчик для уведомлений</comment>
    <type>
      <types>CatalogRef.ПрофилиГруппДоступа</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейДляУведомления</name>
    <comment>Количество дней через сколько необходимо уведомлять старшего расчетчика, если ведомость не согласована.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдминистраторРасширения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

расш/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="33e0072d-7d5b-4298-ae77-31a7cb358f5d">
  <name>ФизическиеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="d51a45d1-6705-4cb5-bbd1-a0af3ac1c3a3">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1051c0c7-1058-427c-8bf5-5e30b8fbfb54">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

расш/src/InformationRegisters/Расш_ЗарплатаСразуРегистрСведенийНастройки/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	
	
	//ДанныеФизЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина,СписокФизЛиц,"ИНН,ДатаРождения",,,ТекущаяДата());
	//ДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина,СписокСотрудников,"Должность",ТекущаяДата());
	//СостоянияСотрудников = СостоянияСотрудников.СостоянияСотрудников();
	
	//Данные для проверки (удалить после проверки работоспособности)
	//"company_id": "f3b3ea79-19f3-4521-b1a0-b3bda7983a7a",
	//  "ogrn": "2013573082807",
	// "inn": "5975591480",
	//  "name": "ООО 1С-Старт",
	//  "limits": {
	//    "unattended": 500000,
	//    "max": 2000000,
	//  },
	//  "persons": [
	//    {
	//  "person_id": "efe057c9-0a79-4fe9-a947-a08bdfe32644",
	//  "name": "Петров Иван Сергеевич",
	//  "inn": "222914370609",
	//  "birthday": "1987-03-15",
	//  "employees": [
	//    {
	//      "employee_id": "f3b3ea79-19f3-4521-b1a0-b3bda7983a7a",
	//      "position": "Директор",
	//      "is_primary": true,
	//      "status": "Работает"
	//    },
	
	//Запишем структуру отправки данных на сервер Зарплата сразу
	//Данные об организации
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("company_id", Строка(Запись.Организация.УникальныйИдентификатор()));
	СтруктураДанных.Вставить("ogrn", Запись.Организация.ОГРН);
	СтруктураДанных.Вставить("inn", Запись.Организация.ИНН);
	СтруктураДанных.Вставить("name", Запись.Организация.НаименованиеПолное);
	
	//Лимиты из регистра настроек зарплата сразу
	СтруктураЛимитов = Новый Структура();	
	СтруктураЛимитов.Вставить("unattended", Запись.ЛимитПлатежаСАвтоакцептом);
	СтруктураЛимитов.Вставить("max",Запись.МаксимальноДопустимаяКСнятиюСумма);
	
	СтруктураДанных.Вставить("limits",СтруктураЛимитов);
	
	//Данные о физ. лицах и сотрудниках
	МассивДанныхФизЛиц = Новый Массив();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Ссылка,
		|	ФизическиеЛица.ИНН КАК ИНН,
		|	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
		|	ФизическиеЛица.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	НЕ ФизическиеЛица.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураФизЛица = Новый Структура();
		СтруктураФизЛица.Вставить("person_id",Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()));
		СтруктураФизЛица.Вставить("name", ВыборкаДетальныеЗаписи.Наименование);
		СтруктураФизЛица.Вставить("inn", ВыборкаДетальныеЗаписи.ИНН);
		СтруктураФизЛица.Вставить("birthday", Формат(ВыборкаДетальныеЗаписи.ДатаРождения,"ДФ=yyyy-MM-dd"));
			
			МассивДанныхСотрудников = Новый Массив();	
			
			//ОсновнойСотрудник = КадровыйУчетРасширенный.ОсновнойСотрудникФизЛица(ВыборкаДетальныеЗаписи.Ссылка,Запись.Организация, ТекущаяДата());
			ОсновныеСотрудники = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаДетальныеЗаписи.Ссылка), Истина, Запись.Организация, ТекущаяДата());
			ДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина,ОсновныеСотрудники,"Должность,ТекущаяДолжность,ТекущийВидЗанятости",ТекущаяДата());
			
			СтруктураСотрудников = Новый Структура();
			//СтруктураСотрудников.Вставить("employee_id",Строка(ОсновнойСотрудник.УникальныйИдентификатор()));	
			//СтруктураСотрудников.Вставить("position", ОсновнойСотрудник.Должность);	
			//СтруктураСотрудников.Вставить("is_primary", Истина);
			//СтруктураСотрудников.Вставить("status",);
			//СостояниеСотрудников = СостоянияСотрудников.СостоянияСотрудников(ОсновныеСотрудники,,ТекущаяДата());
			
			СтруктураФизЛица.Вставить("employees",МассивДанныхСотрудников);	
		
		МассивДанныхФизЛиц.Добавить(СтруктураФизЛица);
		
	КонецЦикла;
	
	СтруктураДанных.Вставить("persons",МассивДанныхФизЛиц);

	//Отправить запрос на сервер Зарплата сразу
	//http://zs-api-ext.1c-start.tech:8080/
	//POST /api/v1/companies/{company_id}
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON,СтруктураДанных);
	ЗаписьJSONx = ЗаписьJSON.Закрыть();
		
	//SSL = Новый ЗащищенноеСоединениеOpenSSL();
	HTTP = Новый HTTPСоединение("zs-api-ext.1c-start.tech",8080,,,,5);
	ЗапросPOST = Новый HTTPЗапрос("/api/v1/companies/");
	ЗапросPOST.УстановитьТелоИзСтроки(ЗаписьJSONx, КодировкаТекста.UTF8);
	ЗапросPOST.Заголовки.Вставить("company_id",Строка(Запись.Организация.УникальныйИдентификатор()));
	HTTPОтвет = HTTP.ОтправитьДляОбработки(ЗапросPOST);
		
	Если НЕ HTTPОтвет.КодСостояния = 200 Тогда
		Сообщить(HTTPОтвет.ПолучитьТелоКакСтроку());
	Иначе
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеНаСервере();
КонецПроцедуры
